{
    "documents": "https://hackrx.blob.core.windows.net/assets/Arogya%20Sanjeevani%20Policy%20-%20CIN%20-%20U10200WB1906GOI001713%201.pdf?sv=2023-01-03&st=2025-07-21T08%3A29%3A02Z&se=2025-09-22T08%3A29%3A00Z&sr=b&sp=r&sig=nzrz1K9Iurt%2BBXom%2FB%2BMPTFMFP3PRnIvEsipAX10Ig4%3D",
    "questions": [
"Decision (e.g., approved or rejected), Amount (if applicable), and Justification, including mapping of each decision to the specific clause(s) it was based on.",
"What are the eligibility criteria for purchasing the National Parivar Mediclaim Plus Policy?",
"Can I port my existing health insurance policy to the National Parivar Mediclaim Plus Policy?",
"What is the maximum entry age for this policy?",
"Are dependent parents covered under this policy?",
"What is the policy tenure options available?",
"Is there a free-look period for this policy, and what are its terms?",
"How is the sum insured determined for a family floater plan?",
"What happens if I miss a renewal premium payment after the grace period?",
"Can I increase my sum insured during the policy tenure?",
"What documents are required for filing a claim?",
"Is cashless hospitalization facility available under this policy?",
"What is the process for availing cashless hospitalization?",
"What is the time limit for intimation of a claim?",
"Are there any diseases or conditions permanently excluded from coverage?",
"Does the policy cover domiciliary hospitalization?",
"What is the co-payment clause, if any, in this policy?",
"Are prosthetic devices covered under this policy?",
"What is the coverage for dental treatments?",
"Is ambulance service covered, and what are the limits?",
"What is the daily cash benefit for hospitalization, if any?",
"Are vaccinations covered under this policy?",
"What is the procedure for grievance redressal?",
"Can I cancel the policy before its tenure ends, and will I get a refund?",
"What is the impact of a claim on my No Claim Discount?",
"Are there any specific exclusions related to adventure sports?",
"Does the policy cover mental illness treatments?",
"What is the coverage for bariatric surgery?",
"Are spectacles, contact lenses, or hearing aids covered?",
"What is the waiting period for specific diseases other than PEDs?",
"How are pre-hospitalization expenses covered?",
"How are post-hospitalization expenses covered?",
"Is there a cumulative bonus offered in this policy?",
"What is the tax benefit available under this policy?",
"Can I add new family members during the policy tenure?",
"What is the process for policy modification or endorsement?",
"Does the policy cover treatment taken abroad?",
"What are the benefits of opting for a higher sum insured?",
"Are genetic disorders covered under this policy?",
"What is the definition of 'Injury' in this policy?",
"How does the policy handle multiple claims in a year?",
"What is the procedure for porting out from this policy?",
"Is rehabilitation expenses covered?",
"What is the policy's stance on experimental or unproven treatments?",
"Are there any geographical restrictions on coverage within India?",
"What are the exclusions related to war or warlike operations?",
"Does the policy cover organ transplant expenses for the recipient?",
"What is the waiting period for specific surgeries, e.g., hernia?",
"What is the benefit of a long-term policy option, if available?"
]
}