{
    "documents": "https://hackrx.blob.core.windows.net/assets/Super_Splendor_(Feb_2023).pdf?sv=2023-01-03&st=2025-07-21T08%3A10%3A00Z&se=2025-09-22T08%3A10%3A00Z&sr=b&sp=r&sig=vhHrl63YtrEOCsAy%2BpVKr20b3ZUo5HMz1lF9%2BJh6LQ0%3D",
    "questions": [
        "What are the dimensions of the Super Splendor motorcycle?",
        "What is the recommended engine oil and when should it be changed?",
        "What is the kerb weight of the Super Splendor Disc-Drum variant?",
        "What is the fuel tank capacity of the motorcycle?",
        "What is the maximum power and torque of the engine?",
        "What are the spark plug specifications and the recommended gap?",
        "What is the size of the front and rear tubeless tires?",
        "What are the electrical specifications of the battery and alternator?",
        "What is the function of the i3s (Idle Stop Start System)?",
        "Where is the Vehicle Identification Number (VIN) located?",
        "What are the recommended safety tips for riding?",
        "What does the Programmed FI malfunction indicator lamp (MIL) indicate?",
        "What is the purpose of the 'Automatic Headlamp ON' feature?",
        "How is the clutch lever free play adjusted?",
        "What is the function of the side stand engine kill feature?",
        "What is the recommended throttle operation during gear shifting?",
        "What are the steps for pre-ride inspection?",
        "How do you lock and unlock the seat?",
        "How is the USB charger used and what precautions should be taken?",
        "What should be done if the engine does not start?",
        "What are the steps to follow for effective braking?",
        "How should a helmet be used and what other protective apparel is recommended?",
        "What are the 'Do's and Don'ts' for safe riding?",
        "What are the tips for a healthy environment related to the motorcycle?",
        "What is the function of the catalytic converter and what precautions should be taken?",
        "How is the headlamp focus adjusted?",
        "What are the circuit fuse and spare fuse ratings?",
        "What should you do if you are involved in a crash?",
        "How should the vehicle be cleaned and washed?",
        "How do you check the functionality of the side stand engine kill feature?"
    ]
}