{
  "answers": [
    "The Grace Period for payment of the premium shall be thirty days.",
    "Yes, the policy covers Maternity Expenses.",
    "means a sudden, unforeseen and involuntary event caused by external, visible and violent means.",
    "Expenses related to the treatment of a Pre-Existing Disease (PED) and its direct complications shall be excluded until the expiry of thirty six (36) months of continuous coverage after the date of inception of the first policy with us.",
    "Room - Up to 1% of SI or actual, whichever is lower",
    "The Company shall indemnify the medical expenses incurred up to sixty days immediately after the insured person is discharged from hospital.",
    "Yes, the organ donor's hospitalization expenses are covered.",
    "No, Air Ambulance is not covered under Plan A.",
    "22.5%",
    "thirty days from date of receipt of the policy document",
    "If any claim made by the insured person, is in any respect fraudulent, or if any false statement, or declaration is made or used in support thereof, or if any fraudulent means or devices are used by the insured person or anyone acting on his/her behalf to obtain any benefit under this policy, all benefits under this policy and the premium paid shall be forfeited.",
    "No, Treatment for, Alcoholism, drug or substance abuse or any addictive condition and consequences thereof (Excl 12) are not covered.",
    "Up to 15% of SI or INR 60,000 whichever is lower",
    "The New Born Baby shall be automatically covered from birth under the Sum Insured available to the mother during the corresponding Policy Period, for up to 3 months of age.",
    "Up to INR 1,00,000",
    "Yes, the policy covers HIV/AIDS treatment.",
    "In the event of the sum insured being exhausted on account of claims arising out of any injury due to road traffic accident during a policy year, if the Insured and/or Insured Person (s) has to subsequently incur any expenses on hospitalisation due to any other disease/ injury, the Company shall reinstate the sum insured as mentioned in the schedule. Reinstatement shall be allowed only once during the policy year and the maximum amount payable under a single claim shall not exceed the sum insured as mentioned in the schedule.",
    "On renewal of policies with a term of one year, a NCD of flat 5% shall be allowed on the * base premium, provided claims are not reported in the expiring Policy.",
    "Expenses of health check up shall be reimbursed (irrespective of past claims) at the end of a block of two continuous policy years",
    "No, Spectacles, contact lens, hearing aid, cochlear implants are not covered.",
    "Three years",
    "means medical treatment for an illness /injury which in the normal course would require care and treatment at a hospital but is actually taken while confined at home under any of the following circumstances.",
    "Within fifteen days from date of discharge from hospital",
    "No, Dental treatment, unless necessitated due to an Injury.",
    "INR 2,000, max. of 5 days"
  ]
}